Repository: qhuydo/flutter_online_tutor
Catalog: lib/presentation/common/l10n/app_*.arb
Languages: ja, vi

# appTitle
source: Online tutor
ja: オンライン チューター
vi: Gia sư trực tuyến

# loginButtonText
source: Login
ja: ログイン
vi: Đăng nhập

# loginHint
source: Already had an account?
ja: 既にアカウントを持っていますか？
vi: Bạn đã có tài khoản?

# signUpHint
source: Not a member yet?
ja: まだ 登録されていませんか？
vi: Bạn không phải là thành viên?

# signUpButtonText
source: Sign up
ja: 登録
vi: Đăng ký

# emailLabel
source: Email
ja: メール

# emailTextBoxHint
source: Enter your email
ja: メールを入力してください
vi: Nhập email

# passwordLabel
source: Password
ja: パスワード
vi: Mật khẩu

# passwordTextBoxHint
source: Enter your password
ja: パスワードを入力してください
vi: Nhập mật khẩu

source: Upcoming lesson
ja: 次のレッスン
vi: Buổi học sắp diễn ra

source: Enter lesson room
ja: ルームに入る
vi: Vào phòng học

# totalHourLearnt
source: You have learnt for {totalHours}
ja: 合計 {totalHours} 時間を学びました。
vi: Bạn đã học {totalHours}

# resetPasswordButtonText
source: Send request link
ja: パスワードリセットリンクのリクエストを送信
vi: Gửi yêu cầu thay đổi mật khẩu

# resetPasswordDescription
source: Please provide your email address to search for your account
ja: あなたのアカウントを検索するために、メールアドレスを提供してください。
vi: Xin hãy nhập email để tìm kiếm tài khoản của bạn.

# resetPassword
source: Reset your password
ja: パスワードをリセット
vi: Đặt lại mật khẩu

# forgotPasswordButtonLabel
source: Forgot your password?
ja: パスワードをお忘れですか？
vi: Quên mật khẩu?

source: Show password
ja: パスワードを表示
vi: Hiện mật khẩu

source: Hide password
ja: パスワードを隠す

# phoneNumberLabel
source: Phone number
ja: 電話番号
vi: Số điện thoại

source: or
ja: または
vi: hoặc

# browseCourseButtonText
source: Browse courses
ja: コースを選択
vi: Chọn khóa học

source: Recommended tutors
ja: おすすめ講師
vi: Gia sư đề xuất

# seeMoreButtonText
source: See all
ja: すべて表示
vi: Xem thêm

# addToFavouriteTooltip
source: Add to favourites
ja: お気に入りに追加
vi: Yêu thích

# removeFromFavouritesTooltip
source: Remove from favourites
ja: お気に入りを削除
vi: Xóa yêu thích

# chatButtonText
source: Chat
ja: チャット
vi: Nhắn tin

# bookButtonText
source: Book
ja: 予約
vi: Đặt lịch

source: Recommended courses
ja: おすすめコース
vi: Khóa học đề xuất

# settingsCardHeader
source: Settings
ja: 設定
vi: Cài đặt

# editProfileLabel
source: Edit profile
ja: プロファイルを変更
vi: Sửa thông tin tài khoản

# myWalletLabel
source: My wallet
ja: ウォレット情報
vi: Thông tin ví

# darkModeLabel
source: Dark mode
ja: ダークモード
vi: Giao diện tối

# darkModeDefaultValue
source: Default
ja: システムのデフォルト
vi: Theo hệ thống

# darkModeEnabledValue
source: Enabled
ja: オン
vi: Đã bật

# darkModeDisabledValue
source: Disabled
ja: オフ
vi: Đã tắt

# darkModeDefaultOption
source: Default
ja: システムのデフォルト
vi: Theo hệ thống

# darkModeEnableOption
source: Enable
ja: オン
vi: Bật

# darkModeDisableOption
source: Disable
ja: オフ
vi: Tắt

# colorPaletteLabel
source: Color palette
ja: テーマ
vi: Chế độ màu

# languageLabel
source: Language
ja: 言語
vi: Ngôn ngữ

# helpAndInfoLabel
source: Help & info
ja: ヘルプとアプリ情報
vi: Thông tin & trợ giúp

# aboutTheAppLabel
source: About the app
ja: アプリについて
vi: Thông tin ứng dụng

# licenseLabel
source: Open source licenses
ja: オープンソースライセンス
vi: Giấy phép mã nguồn mở

# rateLabel
source: Rate the app
ja: アプリを評価
vi: Đánh giá ứng dụng

# termsOfServiceLabel
source: Terms of service
ja: 利用規約
vi: Điều khoản dịch vụ

# privacyPolicyLabel
source: Privacy policy
ja: プライバシーポリシー
vi: Chính sách bảo mật

# changePasswordLabel
source: Change password
ja: パスワードを変更
vi: Đổi mật khẩu

# logOutLabel
source: Log out
ja: ログアウト
vi: Đăng xuất

# languageDefaultValue
source: Follow system
ja: システムのデフォルト
vi: Mặc định

# homeBottomNavItem
source: Home
ja: ホーム
vi: Trang chủ

# courseBottomNavItem
source: Courses
ja: コース
vi: Khóa học

# scheduleBottomNavItem
source: Schedule
ja: スケージュール
vi: Lịch học

# messagesBottomNavItem
source: Messages
ja: メッセージ
vi: Tin nhắn

# settingsBottomNavItem
source: Settings
ja: 設定
vi: Cài đặt

# tutorBottomNavBarItem
source: Tutors
ja: 講師
vi: Gia sư

# findCourseHint
source: Find course...
ja: コースを検索
vi: Tìm kiếm khóa học...

# findEbookHint
source: Find ebook...
ja: 電子書籍を検索
vi: Tìm kiếm sách....

# courseTabLabel
source: Courses
ja: コース
vi: Khóa học

# ebookTabLabel
source: Ebooks
ja: 電子書籍
vi: Sách điện tử

# lessonTimeDescription
source: Lesson time:
ja: 授業の時間：
vi: Thời gian học:

# requestForLessonLabel
source: Request for lesson
ja: 授業のリクエスト
vi: Yêu cầu cho khóa học

# cancelButtonLabel
source: Cancel
ja: キャンセル
vi: Hủy

# fullNameTextBox
source: Full name
ja: 名前
vi: Họ và tên

# fullNameTextBoxHint
source: Enter your full name
ja: お名前を入力してください
vi: Nhập họ và tên

# dateOfBirthTextBoxLabel
source: Date of Birth
ja: 生年月日
vi: Ngày sinh

# dateOfBirthTextBoxHint
source: Choose a date
ja: 生年月日選択してください
vi: Chọn ngày sinh

# countryDropdownLabel
source: Country
ja: 国籍
vi: Quốc tịch

# levelDropdownLabel
source: Level
ja: レベル
vi: Cấp độ

# subjectDropdownLabel
source: Subjects
ja: 科目
vi: Môn học

# noneSelectedOption
source: None selected
ja: 選択なし
vi: Chưa chọn

# testPreparationDropdown
source: Test preparation
ja: 試験準備
vi: Ôn thi

# saveButtonLabel
source: Save
ja: 保存
vi: Lưu

# currentPasswordTextBoxLabel
source: Current password
ja: 現在のパスワード
vi: Mật khẩu hiện tại

# newPasswordTextBoxLabel
source: New password
ja: 新しいパスワード
vi: Mật khẩu mới

# confirmPasswordTextBoxLabel
source: Confirm password
ja: パスワードを確認
vi: Xác nhận mật khẩu

# confirmPasswordTextBoxHint
source: Re-enter your new password
ja: 新パスワードを再入力して確定してください
vi: Nhập lại mật khẩu mới

# changeAvatarButtonTooltip
source: Change profile picture
ja: プロファイル画像を変更
vi: Đổi ảnh đại diện

# findTutorHint
source: Find tutors...
ja: 講師をキーワードで探す
vi: Tìm gia sư...

# languageVietnameseOption
source: Vietnamese (Tiếng Việt)
ja: ベトナム語 (Tiếng Việt)
vi: Tiếng Việt

# languageEnglishOption
source: English
ja: 英語 (English)
vi: Tiếng Anh (English)

# languageJapaneseOption
source: Japanese (日本語)
ja: 日本語
vi: Tiếng Nhật (日本語)

# becomeTeacherLabel
source: Become a tutor
ja: 講師として登録
vi: Trở thành gia sư

# basicInfoLabel
source: Basic
ja: 基本的情報
vi: Thông tin cơ bản

# tutoringNameTextBoxLabel
source: Tutoring name
ja: 名前
vi: Tên người dạy

# uploadProfessionalPhotoLabel
source: Please upload a professional photo.
ja: プロの写真ファイルをアップロードしてご利用ください。
vi: Vui lòng dùng ảnh đại diện chuyên nghiệp,

# cvLabel
source: CV
ja: 履歴書

# cvInfoNotice
source: Students will review this information to determine whether you are a good fit for them.
ja: 学生はこのプロファイル情報を確認し、あなたが自分に適してかどうか判断します。
vi: Học viên sẽ xem xét các thông tin này để xem thử liệu bạn có phù hợp với yêu cầu của họ hay không.

# protectPrivacyNotice
source: In order to protect your privacy, please refrain from sharing personal information such as emails and phone numbers.
ja: あたなのプライバシーを保護するため、メールや電話番号といった個人情報の共有はご遠慮ください。
vi: Để bảo vệ quyền riêng tư, xin vui lòng không cung cấp thông tin cá nhân (email, số điện thoại) trong hồ sơ của bạn.

# interestTextBoxLabel
source: Interests
ja: 興味
vi: Sở thích

# interestTextBoxHint
source: Interests, hobbies, memorable life experiences, or anything else you'd like to share.
ja: 興味、趣味、思い出に残る人生経験といったなにか共有したいのとを入力してください。
vi: Những điều thú vị, sở thích, những trải nghiệm đáng nhớ hoặc bất cứ điều gì mà bạn muốn chia sẻ.

# academicLevelTextBoxLabel
source: Academic level
ja: アカデミックレベル
vi: Trình độ học vấn

# academicLevelTextBoxHint
source: Example: "Bachelor of Arts in English from Cambly University; Certified yoga instructor, Second Language Acquisition and Teaching (SLAT) certificate from Cambly University"
ja: 例：「シカゴにあるデポール大学から心理学の文学士号を取得」、「南カリフォルニア大学で英語教育学の修士号を取得した」
vi: Ví dụ: "Bằng cử nghệ thuật của đại học Cambly; Chứng nhận huấn luyện viên Yoga, Chứng chỉ Tiếp thu và Giảng dạy Ngôn ngữ Thứ hai (SLAT) của Đại học Cambly"

# experienceTextBoxLabel
source: Experience
ja: 経験
vi: Kinh nghiệm

# professionTextBoxLabel
source: Current or Previous Profession
ja: 過去または現在の職業
vi: Nghề nghiệp hiện tại hoặc trước đây

# aboutLanguageTitle
source: Languages I speak
ja: 言語知識
vi: Về kiến thức ngôn ngữ

# aboutTeachingTitle
source: About teaching
ja: 教えることについて
vi: Về việc dạy học

# introductionTextBoxLabel
source: Introduction
ja: 自分紹介
vi: Giới thiệu bản thân

# specialitiesDropdown
source: Specialities
ja: 専門
vi: Chuyên môn

# nextStepButtonLabel
source: Next
ja: 次へ
vi: Bước tiếp theo

# targetStudentTextBoxLabel
source: Who I teach
ja: 望ましい受講対象者
vi: Bạn chuyên dạy các học viên có trình độ nào

# introductionVideoLabel
source: Introduction video
ja: 紹介ビデオ
vi: Video giới thiệu

# introductionVideoStepTitle
source: Introduce yourself!
ja: 自己紹介をしましょう
vi: Hãy giới thiệu bản thân

# introductionVideoStepTipsLabel
source: Some helpful tips: 1. Find a clean & quiet place 2. Simle & look at the camera 3. Dress smartly 4. Speak for 1 - 3 minutes 5. Brand yourself & have fun
ja: 役立つヒント: １．静かな場所を見つける ２．笑顔でカメラの方を見る ３．こぎれいな服装をする ４．１〜３分くらい話す
vi: Một số mẹo giúp ích: 1. Tìm một nơi sạch sẽ, yên ắng 2. Hướng ánh mắt vào máy ảnh và mỉm cười 3. Mặc trang phục gọn gàng, sạch đẹp 4. Giới thiệu khoảng từ 1 đến 3 phút

# previousStepButtonText
source: Previous
ja: 前へ
vi: Bước trước

# chooseVideoButtonText
source: Choose a video
ja: ビデオを選択
vi: Chọn video

# approvalStepLabel
source: Approval
ja: 承認
vi: Xác nhận

# approvalStepDescriptionTitle
source: You have done all the steps! Please wait for the the operator's approval
ja: すべてのステップを完了しました、 オペレータからの承認をお待ちください。
vi: Bạn đã hoàn thành tất cẳ các bước! Vui lòng chờ phê duyệt

# backButtonText
source: Back
ja: 戻る
vi: Quay lại

# targetStudentBeginnerValue
source: Beginners
ja: 初心者
vi: Người mới bắt đầu

# targetStudentIntermediateValue
source: Intermediate learners
ja: 中級者
vi: Trung cấp

# targetStudentAdvancedValue
source: Advanced learners
ja: 上級者
vi: Cao cấp

# completeProfileStepTitle
source: Complete profile
ja: プロフィールを完了する
vi: Hoàn thành hồ sơ

# viewReviewButtonText
source: Review
ja: レビュー
vi: Đánh giá

# favouriteButtonIconText
source: Favourite
ja: お気に入り
vi: Yêu thích

# reportIconButtonText
source: Report
ja: レポート
vi: Báo cáo sai phạm

# tutorDetailsPageTitle
source: About the tutor
ja: 講師について
vi: Gia sư

# overviewTitleText
source: Overview
ja: 概要
vi: Tổng quát

# reasonToTakeCourseSubtitle
source: Reasons to take this course
ja: このコースを受講をおすすめする理由
vi: Lý do tại sao bạn nên học khóa học này

# canDoSubtitle
source: What will you be able to do
ja: このコースで出来るようになること
vi: Những điều có thể làm

# experienceLevelTitle
source: Experience level
ja: 経験のレベル
vi: Trình độ cần thiết

# courseLengthTitle
source: Course length
ja: コースの長さ
vi: Độ dài khóa học

# courseTitle
source: Course
ja: コース
vi: Khóa học

# syllabusTitle
source: Syllabus
ja: シラバス
vi: Giáo án

# registerButtonTitle
source: Register
ja: 登録する
vi: Đăng ký

# courseLevelAny
source: Any level
ja: どのレベルでも
vi: Không quan trọng trình độ

# courseLevelBeginner
source: Beginner
ja: 初心者
vi: Sơ cấp

# courseLevelUpperBeginner
source: Upper-beginner
ja: 初級上
vi: Sơ trung cấp

# courseLevelPreIntermediate
source: Pre-intermediate
ja: 中級前
vi: Tiền trung cấp

# courseLevelIntermediate
source: Intermediate
ja: 中級
vi: Trung cấp

# courseLevelUpperIntermediate
source: Upper-intermediate
ja: 中級上
vi: Thượng trung cấp

# courseLevelPreAdvanced
source: Pre-Advanced
ja: 上級前
vi: Tiền thượng cấp

# courseLevelAdvanced
source: Advanced
ja: 上級
vi: Thượng cấp

# courseLevelVeryAdvanced
source: Very advanced
ja: 非常に上級
vi: Thượng thừa

# syllabusBeforeLessonTitle
source: Before the lesson
ja: レッスン前に
vi: Trước buổi học

# syllabusLessonSlideTitle
source: Lesson slide
ja: レッスンのスライド
vi: Slide bài giảng

# syllabusLessonVideoTitle
source: Review video
ja: 動画で復習する
vi: Video ôn tập

# syllabusBeforeLessonSubtitle
source: Review these slides to prepare for your lesson
ja: これらのスライドを復習してレッスンの準備をしましう
vi: Hãy xem slide chuẩn bị trước khi vào bài học

# syllabusLessonSlideSubtitle
source: These slides are available as a preview of the course
ja: これらのスライドはコースのプレービューとして利用できます
vi: Slide bài giảng dùng để xem trong trước tổng quan trong khóa học này có gì

# syllabusReviewVideoSubtitle
source: You can review the lesson slides once you have completed the lesson
ja: 講師とのレッスンを完了すると、レッスンスライドで復習ができるようになります
vi: Bạn có thể xem lại slide buổi học sau khi hoàn thành bài học

# meetingRoomTitle
source: Meeting room
ja: ミーティングルーム
vi: Phòng học

# writeMessageInputText
source: Type your message
ja: メッセージを入力
vi: Nhập tin nhắn

# historyTitle
source: Lesson history
ja: レッスンの履歴
vi: Lịch sử các buổi học

# openEbookButtonText
source: Open ebook from Browser
ja: ブラウザで開く
vi: Mở từ trình duyệt web

# passwordChangedDialogContent
source: Please use the new password next time you login.
ja: 次回のログインから、新しいパスワードを使用してください。
vi: Xin hãy nhập mật khẩu mới khi đăng nhập ở lần tiếp theo.

# passwordChangedDialogTitle
source: Password has been changed successfully
ja: パスワードが正常に変更されました。
vi: Mật khẩu đã được đổi thành công

# valueFalureUnknownError
source: An unknown error occurred
ja: 不明なエラーが発生した。
vi: Xuất hiện lỗi

# valueFailureEmptyValue
source: Empty value is not allowed
ja: 値を入力してください。
vi: Xin hãy nhập giá trị

# valueFailureValueInvalid
source: Value is invalid
ja: 値が無効です。
vi: Giá trị không hợp lệ

# reportDialogTitle
source: Report
ja: 報告
vi: Báo cáo lạm dụng

# filterDialogTitle
source: Filter
ja: フィルタ
vi: Lọc

# filterOptionSortBy
source: Sort by
ja: ソート・キー
vi: Sắp xếp bởi

# clearFilterButton
source: Clear filters
ja: フィルタを消去
vi: Xóa lọc

# tutorSortByDefaultSort
source: Name
ja: 氏名
vi: Tên

# tutorSortByFavourite
source: Favourite
ja: お気に入り
vi: Ưa thích

# tutorSortByRating
source: Rating
ja: 評価
vi: Điểm đánh giá

# editedTextLabel
source: (Edited)
ja: （編集済み）
vi: (Đã chỉnh sửa)

# bookDialogTitle
source: Book a class
ja: 授業を予約
vi: Đặt lịch hẹn

# balanceLabel
source: Balance
ja: 残高
vi: Số dư

# balanceStatusText
source: {count, plural, other {You have {count} courses left} one {You have one course left}}
ja: {count, plural, other {{count} コースを購入できます。}}
vi: {count, plural, other {Bạn còn {count} khóa học}}

# priceTextLabel
source: Price
ja: 価格
vi: Giá

# priceValue
source: {count, plural, one {one course} other {{count} courses}}
ja: {count, plural, other {{count} コース} other {{count} コース}}
vi: {count, plural, other {{count} khóa học}}

# tutorNotFoundTextLabel
source: Not found any tutors match the query
ja: そのクエリに一致するインライン講師はいません
vi: Không tìm thấy gia sư theo yêu cầu tìm kiếm

# courseLengthTextLabel
source: {count, plural, one {One lesson} other {{count} lessons}}
ja: {count, plural, other {{count} レッスン}}
vi: {count, plural, other {{count} bài học}}

# unableToOpenBrowser
source: Cannot open web browser
ja: ブラウザを開くことができません
vi: Không thể mở được trình duyệt web

# phoneNumberFailureInvalidPhoneNumber
source: Invalid phone number
ja: 電話番号が無効です。
vi: Số điện thoại nhập vào không hợp lệ

# authenticationFailureWrongEmailOrPassword
source: Incorrect email or password
ja: メールアドレスまたはパスワードが正しくありません。
vi: Email hoặc mật khẩu không đúng

# authenticationFailureWrongPhoneOrPassword
source: Incorrect phone number or password
ja: 電話番号またはパスワードが正しくありません。
vi: Số điện thoại hoặc mật khẩu không đúng

# authenticationFailureNoInternet
source: No internet connection
ja: インターネット接続がありません。
vi: Không có kết nối mạng

# authenticationFailureServerError
source: An internal server error has occurred
ja: 内部サーバーエラーが発生しました。
vi: Có lỗi xảy ra tại máy chủ

# authenticationFailureAlreadySignedOut
source: You are already signed out
ja: 既にサインアウトしています。
vi: Bạn đã đăng xuất ra khỏi hệ thống rồi

# authenticationFailureEmailTaken
source: The email is already taken
ja: マールアドレスは既に受け付けられています。
vi: Email đã được sử dụng để đăng ký tài khoản

# authenticationFailurePhoneTaken
source: The phone number is already taken
ja: 電話番号は既に受け付けられています。
vi: Số điện thoại đã được sử dụng để đăng ký tài khoản

# authenticationFailureEmailNotExist
source: The email address does not exist within the system. Please register a new account first.
ja: このメールアドレスはすでにシステムに存在しません。アカウントの新規登録を行ってください。
vi: Email không tồn tại trong hệ thống. Vui lòng đăng ký tài khoản mới.

# authenticationErrorWrongPassword
source: The entered password is incorrect.
ja: 入力されたパスワードが正しくありません。
vi: Mật khẩu không đúng.

# authenticationFailureUnauthorized
source: Error: unauthorized
ja: エラー：不正アクセス
vi: Lỗi: không có quyền truy cập

# resetPasswordDialogTitle
source: Your password has been reset
ja: パスワードはリセットされました。
vi: Mật khẩu của bạn đã được đặt lại

# resetPasswordContent
source: Your password has been reset to {password}.
ja: 確認リンクのメールをチェックしてください。
vi: Mật khẩu của bạn đã được đổi lại thành {password}.

# emailFailureInvalidEmail
source: The entered email is invalid
ja: メールアドレスが無効です。
vi: Email không hợp lệ

# emailFailureEmptyValue
source: Please enter your email address
ja: メールアドレスを入力してください。
vi: Xin hãy nhập email

# passwordFailureShortPassword
source: The password you entered was too short.
ja: 入力したパスワードが短すぎます。
vi: Mật khẩu bạn nhập vào quá ngắn, xin hãy nhập mật khẩu dài hơn

# passwordFailureEmptyPassword
source: Please enter your password
ja: パスワードを入力してください。
vi: Xin hãy nhập mật khẩu

# passwordFailureWrongCurrentPassword
source: The entered password is incorrect.
ja: 入力されたパスワードが正しくありません。
vi: Mật khẩu không đúng.

# passwordValueWrongNewPassword
source: New password and confirm password does not match
ja: 新しいパスワードと確認パスワードが一致しません
vi: Mật khẩu mới không khớp

# favouriteTutorsTitle
source: Favourite tutors
ja: お気に入りの講師
vi: Gia sư yêu thích

source: Page not found
ja: ページが見つかりません。
vi: Không tìm thấy trang

# emptyResult
source: No result display
ja: 表示する結果がありません。
vi: Không tìm thấy kết quả để hiển thị

# noteLabel
source: Note
ja: ノート
vi: Ghi chú

# bookedLabel
source: Booked
ja: 予約済み
vi: Đã đặt lịch

# reservedLabel
source: Reserved
ja: 予約されています
vi: Đã được đặt

# pastScheduleLabel
source: Cannot be booked
ja: 予約不可
vi: Không thể đặt

# meetingTime
source: {from} - {to}
vi: {from} đến {to}
